wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/docs/SL_SC7U22_AOI_Angle_Driver.c

#include "SL_SC7U22_AOI_Angle_Driver.h"
#include "math.h"
#include "delay.h"
#include "usart.h"

#if SL_Sensor_Algo_Release_Enable==0x00
#include "usart.h"
#include "led.h"
#endif


//I2C SPI选择
//#define SL_SC7U22_SPI_EN_I2C_DISABLE   0x00 //必须和SL_SPI_IIC_INTERFACE相反；
#define SL_SPI_IIC_INTERFACE           0x01 //必须和SL_SC7A22H_SPI_EN_I2C_DISABLE 相反；
//原始数据高通输出使能控制宏定义
#define SL_SC7U22_RAWDATA_HPF_ENABLE   0x00
//中断脚默认输出电平控制宏定义
#define SL_SC7U22_INT_DEFAULT_LEVEL    0x01
//SDO  上拉电阻控制
#define SL_SC7U22_SDO_PullUP_ENABLE    0x01
//AOI唤醒中断检测使能 
#define SL_SC7U22_AOI_Wake_Up_ENABLE   0x00

//FIFO_STREAM使能//FIFO_WTM使能
//#define SL_SC7U22_FIFO_STREAM_WTM  	   0x01//0X00=STREAM MODE 0X01=FIFO MODE

static void sl_delay(unsigned char sl_i)
{
    unsigned int sl_j = 10;

	sl_j = sl_j*1000*sl_i;
    while(sl_j--);
}


unsigned char SL_SC7U22_Check(void)
{
	unsigned char reg_value=0;
	
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x00
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, SC7U22_WHO_AM_I, 1, &reg_value);
#if SL_Sensor_Algo_Release_Enable==0x00
	USART_printf( USART1, "0x%x=0x%x\r\n",SC7U22_WHO_AM_I,reg_value);
#endif
	if(reg_value==0x6A)
		return 0x01;//SC7U22
	else
		return 0x00;//其他芯片
}

unsigned char SL_SC7U22_Config(void)
{
	unsigned char Check_Flag=0;
	unsigned char reg_value=0;
	
#if SL_SPI_IIC_INTERFACE==0x00 //SPI
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x90
	sl_delay(1);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x4A, 0x66);
	sl_delay(1);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x83);//goto 0x6F
	sl_delay(1);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x6F, 0x04);//I2C disable
	sl_delay(1);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x6F
	sl_delay(1);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x4A, 0x00);
	sl_delay(1);
#endif
	Check_Flag=SL_SC7U22_Check();
//	Check_Flag= SL_SC7U22_SOFT_RESET();
//	Check_Flag=1;//强制初始化
#if SL_Sensor_Algo_Release_Enable==0x00
	PWM_PB4(0);
	USART_printf( USART1, "SL_SC7U22_Check=0x%x\r\n",Check_Flag);
#endif	
	if(Check_Flag==1)
	{
		Check_Flag= SL_SC7U22_POWER_DOWN();
	}
#if SL_Sensor_Algo_Release_Enable==0x00
	USART_printf( USART1, "SL_SC7U22_POWER_DOWN=0x%x\r\n",Check_Flag);
#endif
	if(Check_Flag==1)
	{
		Check_Flag= SL_SC7U22_SOFT_RESET();
	}
#if SL_Sensor_Algo_Release_Enable==0x00
	USART_printf( USART1, "SL_SC7U22_SOFT_RESET=0x%x\r\n",Check_Flag);
#endif
	if(Check_Flag==1)
	{
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x00
		delay_nms(10);//10ms		
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7D, 0x0E);//PWR_CTRL ENABLE ACC+GYR+TEMP
		delay_nms(10);//10ms
	
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x40, 0x06);//ACC_CONF 0x07=50Hz
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x41, 0x01);//ACC_RANGE  ±8G
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x42, 0x86);//GYR_CONF 0x87=50Hz
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x43, 0x00);//GYR_RANGE 2000dps
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x43, 0x00);//GYR_RANGE 2000dps
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x04, 0x50);//COM_CFG

#if SL_SC7U22_RAWDATA_HPF_ENABLE ==0x01
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE,0x7F, 0x83);//goto 0x83
		sl_delay(1);
		SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x26, 1, &reg_value);
		reg_value=reg_value|0xA0;
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x26, reg_value);//HPF_CFG  rawdata hpf
#endif

#if SL_SC7U22_AOI_Wake_Up_ENABLE==0x01
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x30, 0x2A);//XYZ-ENABLE
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x32, 0x01);//VTH
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x33, 0x01);//TTH
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x3F, 0x30);//HPF FOR AOI1&AOI2
#endif

#if SL_SC7U22_FIFO_ENABLE==0x01
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x1E,0x1D);//
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x1D,0x00);//
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x1D,0x20);//
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x1C,0x37);//
#endif





#if SL_SC7U22_SDO_PullUP_ENABLE ==0x01
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE,0x7F, 0x8C);//goto 0x8C
		sl_delay(1);
		SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x30, 1, &reg_value);
		reg_value=reg_value&0xFE;//CS PullUP_enable
		reg_value=reg_value&0xFD;//SDO PullUP_enable
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x30, reg_value);

		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE,0x7F, 0x00);//goto 0x00
		delay_nms(1);
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE,0x7F, 0x00);//goto 0x00
		delay_nms(1);
#else
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE,0x7F, 0x8C);//goto 0x8C
		sl_delay(1);
		SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x30, 1, &reg_value);
		reg_value=reg_value&0xFE;//CS PullUP_enable
		reg_value=reg_value|0x02;//SDO PullUP_disable	
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x30, reg_value);

		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE,0x7F, 0x00);//goto 0x00
		sl_delay(1);
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE,0x7F, 0x00);//goto 0x00
		sl_delay(1);
#endif

		return 1;
	}
	else
		return 0;
}


//读取时间戳
unsigned int SL_SC7U22_TimeStamp_Read(void)
{
	unsigned char  time_data[3];
	unsigned int time_stamp;
	
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x18, 1, &time_data[0]);
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x19, 1, &time_data[1]);
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x20, 1, &time_data[2]);

	time_stamp=(unsigned int)(time_data[0]<<16|time_data[1]<<8|time_data[2]);
	
	return time_stamp;
}

#if SL_SC7U22_FIFO_ENABLE ==0x00
//100Hz 10ms read once
void SL_SC7U22_RawData_Read(signed short * acc_data_buf,signed short * gyr_data_buf)
{
	unsigned char  raw_data[12];
	unsigned char  drdy_satus=0x00;
	unsigned short drdy_cnt=0;
	
	while((drdy_satus&0x03)!=0x03)//acc+gyro
//	while((drdy_satus&0x01)!=0x01)//acc
	{
		drdy_satus=0x00;
		sl_delay(1);
		SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x0B, 1, &drdy_satus);
		drdy_cnt++;
		if(drdy_cnt>30000) break;
	}
	
