wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/docs/SL_SC7U22_AOI_Angle_Driver.c
#if SL_Sensor_Algo_Release_Enable==0x00
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x30, 1, &drdy_satus);
//	USART_printf( USART1, "RawData:0x40=%x\r\n",drdy_satus);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x40, 1, &drdy_satus);
//	USART_printf( USART1, "RawData:0x40=%x\r\n",drdy_satus);	
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x06, 1, &drdy_satus);
//	USART_printf( USART1, "RawData:0x06=%x\r\n",drdy_satus);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x07, 1, &drdy_satus);
//	USART_printf( USART1, "RawData:0x07=%x\r\n",drdy_satus);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x7D, 1, &drdy_satus);
//	USART_printf( USART1, "RawData:0x7D=%x\r\n",drdy_satus);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x31, 1, &drdy_satus);
//	USART_printf( USART1, "RawData:0x31=%x\r\n",drdy_satus);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x02, 1, &drdy_satus);
//	USART_printf( USART1, "RawData:0x02=%x\r\n",drdy_satus);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x03, 1, &drdy_satus);
//	USART_printf( USART1, "RawData:0x03=%x\r\n",drdy_satus);
#endif
	
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x0C, 12, &raw_data[0]);	

	acc_data_buf[0] =(signed short)((((unsigned char)raw_data[0])* 256)  + ((unsigned char)raw_data[1]));//ACCX-16位
	acc_data_buf[1] =(signed short)((((unsigned char)raw_data[2])* 256)  + ((unsigned char)raw_data[3]));//ACCY-16位
	acc_data_buf[2] =(signed short)((((unsigned char)raw_data[4])* 256)  + ((unsigned char)raw_data[5]));//ACCZ-16位
	gyr_data_buf[0] =(signed short)((((unsigned char)raw_data[6])* 256)  + ((unsigned char)raw_data[7]));//GYRX-16位
	gyr_data_buf[1] =(signed short)((((unsigned char)raw_data[8])* 256)  + ((unsigned char)raw_data[9]));//GYRY-16位
	gyr_data_buf[2] =(signed short)((((unsigned char)raw_data[10])* 256) + ((unsigned char)raw_data[11]));//GYRZ-16位
	
#if SL_Sensor_Algo_Release_Enable==0x00
	USART_printf( USART1, "RawData:AX=%d,AY=%d,AZ=%d,GX=%d,GY=%d,GZ=%d\r\n",acc_data_buf[0],acc_data_buf[1],acc_data_buf[2],gyr_data_buf[0],gyr_data_buf[1],gyr_data_buf[2]);
#endif 
	
}
#else

#if SL_Sensor_Algo_Release_Enable==0x00
#define SL_SC7U22_WAIT_FIFO_LEN_ENABLE 0x00//0x01
#else
#define SL_SC7U22_WAIT_FIFO_LEN_ENABLE 0x00
#endif
unsigned char  Acc_FIFO_Num;
unsigned char  Gyr_FIFO_Num;

unsigned char  SL_SC7U22_FIFO_DATA[1024];

unsigned short SL_SC7U22_FIFO_Read(signed short *accx_buf,signed short *accy_buf,signed short *accz_buf,signed short *gyrx_buf,signed short *gyry_buf,signed short *gyrz_buf)
{
	int16_t Acc_x = 0, Acc_y = 0, Acc_z = 0;
	int16_t Gyr_x = 0, Gyr_y = 0, Gyr_z = 0;		
	unsigned char  fifo_num1=0;
	unsigned char  fifo_num2=0;
	unsigned short fifo_num=0;
	unsigned short fifo_len=0;
	unsigned short temp = 0;
	unsigned short i = 0 ;
    unsigned char header[2];
	unsigned short j;
	
#if SL_Sensor_Algo_Release_Enable==0x00	//user can set to zero
#if SL_SC7U22_WAIT_FIFO_LEN_ENABLE==0x00
	while((fifo_num1&0x20)!=0x20)
	{
		sl_delay(200);
		SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x1F,1,&fifo_num1);
	}
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x1F,1,&fifo_num1);
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x20,1,&fifo_num2);
	if((fifo_num1&0x10)==0x10)
	{
		fifo_num=2048;
	}
	else
	{
		fifo_num=(fifo_num1&0x0F)*256+fifo_num2;
	}
#else
	while(fifo_num2<194)//32
	{
		SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x1F,1,&fifo_num1);
		SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x20,1,&fifo_num2);
		sl_delay(20);
		fifo_wait++;
		if(fifo_wait>30000) break;
	}
	fifo_wait=0;
	fifo_num=fifo_num2;
#endif
	
#else
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x1F,1,&fifo_num1);
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x20,1,&fifo_num2);
	if((fifo_num1&0x10)==0x10)
	{
		fifo_num=2048;
	}
	else
	{
		fifo_num=(fifo_num1&0x0F)*256+fifo_num2;
	}
#endif
	
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x21, fifo_num*2, SL_SC7U22_FIFO_DATA);//单地址连续读取 BYTE NUM
//	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x1D, 0x00);//BY PASS MODE
//	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x1D, 0x20);//Stream MODE
	printf("SC7U22_FIFO_NUM1:%d\n",fifo_num);
#if SL_Sensor_Algo_Release_Enable==0x00
//	USART_printf(USART1,"0x1F:0x%x 0x20:0x%x\n",fifo_num1,fifo_num2);
//	USART_printf(USART1,"SC7U22_FIFO_NUM1:%d\n",fifo_num);
#endif
	fifo_len=0;
	
	i = 0;
	Acc_FIFO_Num=0;
	Gyr_FIFO_Num=0;
	while(i < fifo_num*2)
	{	
		//header process 1
		header[0] = SL_SC7U22_FIFO_DATA[i + 0];
		header[1] = SL_SC7U22_FIFO_DATA[i + 1];
		i = i + 2;
		
		//timestamp process 2
		if(header[1] & 0x80)
		{
			i = i + 4;//every frame  include the timestamp, 4 bytes
		}
		//acc process 3
		if(header[0] & 0x04)
		{
			accx_buf[Acc_FIFO_Num]	=	((s16)(SL_SC7U22_FIFO_DATA[i + 0] * 256 + SL_SC7U22_FIFO_DATA[i + 1])) ;
			accy_buf[Acc_FIFO_Num]	=	((s16)(SL_SC7U22_FIFO_DATA[i + 2] * 256 + SL_SC7U22_FIFO_DATA[i + 3])) ;
			accz_buf[Acc_FIFO_Num]	=	((s16)(SL_SC7U22_FIFO_DATA[i + 4] * 256 + SL_SC7U22_FIFO_DATA[i + 5])) ;
			printf("AccNum : %d  ,Acc_x : %4d, Acc_y : %4d, Acc_z : %4d,\r\n",Acc_FIFO_Num, accx_buf[Acc_FIFO_Num], accy_buf[Acc_FIFO_Num], accz_buf[Acc_FIFO_Num]);	
			i = i + 6;
			Acc_FIFO_Num++;
		}
		//gyro process 3
		if(header[0] & 0x02)
		{			
			gyrx_buf[Gyr_FIFO_Num]	=	((s16)(SL_SC7U22_FIFO_DATA[i + 0] * 256 + SL_SC7U22_FIFO_DATA[i + 1])) ;
			gyry_buf[Gyr_FIFO_Num]	=	((s16)(SL_SC7U22_FIFO_DATA[i + 2] * 256 + SL_SC7U22_FIFO_DATA[i + 3])) ;
			gyrz_buf[Gyr_FIFO_Num]	=	((s16)(SL_SC7U22_FIFO_DATA[i + 4] * 256 + SL_SC7U22_FIFO_DATA[i + 5])) ;	
			printf("GyrNum : %d, Gyr_x : %4d, Gyr_y : %4d, Gyr_z : %4d,\r\n",Gyr_FIFO_Num, gyrx_buf[Gyr_FIFO_Num], gyry_buf[Gyr_FIFO_Num], gyrz_buf[Gyr_FIFO_Num]);	
			i = i + 6;
			Gyr_FIFO_Num++;
		}
		
		//temperature process 1
		if(header[0] & 0x01)
		{	
			i = i + 2;
		}
	}		

	
	return fifo_len;
}
#endif


unsigned char SL_SC7U22_POWER_DOWN(void)
{
	unsigned char SL_Read_Reg  = 0xff;
	
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x00
	sl_delay(20);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7D, 0x00);//POWER DOWN
	sl_delay(200);
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x7D, 1,&SL_Read_Reg);
	if(SL_Read_Reg==0x00)   return  1;
	else                    return  0;
}


unsigned char SL_SC7U22_SOFT_RESET(void)
{
	unsigned char SL_Read_Reg  = 0xff;
	
