wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/docs/SL_SC7U22_AOI_Angle_Driver.c
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x00
	delay_nms(1);
#if SL_Sensor_Algo_Release_Enable==0x00
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x04, 1,&SL_Read_Reg);
	USART_printf( USART1, "SL_SC7U22_SOFT_RESET1 0x04=0x%x\r\n",SL_Read_Reg);
	SL_Read_Reg = 0xff;
#endif
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x04, 0x10);//BOOT
#if SL_Sensor_Algo_Release_Enable==0x00	
	PWM_PB4(1);
#endif
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x4A, 0xA5);//SOFT_RESET
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x4A, 0xA5);//SOFT_RESET
	delay_nms(200);
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x04, 1,&SL_Read_Reg);
#if SL_Sensor_Algo_Release_Enable==0x00	
	PWM_PB4(0);
	USART_printf( USART1, "SL_SC7U22_SOFT_RESET2 0x08=0x%x\r\n",SL_Read_Reg);
#endif
	if(SL_Read_Reg==0x50)   return  1;
	else                    return  0;
	
}


/****acc_enable ==0 close acc;acc_enable ==1 open acc******/
/****gyro_enable==0 close acc;gyro_enable==1 open acc******/
unsigned char SL_SC7U22_Open_Close_SET(unsigned char acc_enable,unsigned char gyro_enable)
{
	unsigned char SL_Read_Reg  = 0xff;
	unsigned char SL_Read_Check= 0xff;
	
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x00
	sl_delay(1);
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x7D, 1,&SL_Read_Reg);
	
	if(acc_enable==0)
	{
		SL_Read_Reg=SL_Read_Reg&0xFB;//Bit.ACC_EN=0
	}
	else if(acc_enable==1)
	{
		SL_Read_Reg=SL_Read_Reg|0x04;//Bit.ACC_EN=1
	}
	if(gyro_enable==0)
	{
		SL_Read_Reg=SL_Read_Reg&0xFD;//Bit.GYR_EN=0
	}
	else if(gyro_enable==1)
	{
		SL_Read_Reg=SL_Read_Reg|0x02;//Bit.GYR_EN=1
	}
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7D, SL_Read_Reg);//PWR_CTRL ENABLE ACC+GYR+TEMP
	sl_delay(5);//5ms
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7D, SL_Read_Reg);//PWR_CTRL ENABLE ACC+GYR+TEMP
	sl_delay(20);//10ms
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x7D, 1,&SL_Read_Check);
	if(SL_Read_Reg!=SL_Read_Check)
	{
#if SL_Sensor_Algo_Release_Enable==0x00	
		USART_printf( USART1, "SL_Read_Reg=0x%x  SL_Read_Check=0x%x\r\n",SL_Read_Reg,SL_Read_Check);
#endif
		return 0;
	}
	return 1;
}


/*******open INT******/
unsigned char SL_SC7U22_IN_SLEEP_SET(unsigned char acc_odr,unsigned char vth,unsigned char tth,unsigned char int_io)
{
	unsigned char SL_Read_Reg  = 0xff;
	unsigned char SL_Acc_Odr_Reg  = 0xff;
	
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x00
	sl_delay(1);
	if(int_io==1)
	{
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x06, 0x02);//AOI1-INT1
	}
	else if(int_io==2)
	{
		SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x08, 0x02);//AOI1-INT2
	}
	
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x04, 1, &SL_Read_Reg);
#if SL_SC7U22_INT_DEFAULT_LEVEL ==0x01
	SL_Read_Reg=SL_Read_Reg|0x04;
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x04, SL_Read_Reg);//defalut high level&& push-pull
#else
	reg_value=reg_value&0xDF;
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x06, SL_Read_Reg);//defalut low  level&& push-pull	
#endif
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x30, 0x2A);//AIO1-Enable
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x32, vth);//VTH
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x33, tth);//TTH
	
	if(acc_odr==12)
	{
		SL_Acc_Odr_Reg=0x05;
	}
	else if(acc_odr==25)
	{
		SL_Acc_Odr_Reg=0x06;
	}
	else if(acc_odr==50)
	{
		SL_Acc_Odr_Reg=0x07;
	}
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x40, SL_Acc_Odr_Reg);//ACC_CONF
	delay_nms(5);//5ms
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7D, 0x04);//acc open and gyro close
	delay_nms(5);//5ms
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7D, 0x04);//acc open and gyro close
	sl_delay(200);
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x7D, 1,&SL_Read_Reg);
	
	if(SL_Read_Reg!=0x04)
	{
#if SL_Sensor_Algo_Release_Enable==0x00	
		USART_printf( USART1, "SL_Read_Reg=0x%x 0x04\r\n",SL_Read_Reg);
#endif
		return 0;
	}
	return 1;
}

/*******ODR SET:25 50 100 200******************/
/*******acc range:2 4 8 16*********************/
/*******gyro range:125 250 500 1000 2000*******/
/*******acc_hp_en: 0=disable 1=enable**********/
/*******gyro_hp_en:0=disable 1=enable**********/
unsigned char SL_SC7U22_WakeUp_SET(unsigned char odr_mode,unsigned char acc_range,unsigned char acc_hp_en,unsigned short gyro_range,unsigned char gyro_hp_en)
{
	unsigned char SL_Odr_Reg        = 0x00;
	unsigned char SL_acc_mode_Reg   = 0x00;
	unsigned char SL_gyro_mode_Reg  = 0x00;	
	unsigned char SL_acc_range_Reg  = 0x00;
	unsigned char SL_gyro_range_Reg = 0x00;
	unsigned char SL_Read_Check     = 0xff;
	
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7F, 0x00);//goto 0x00
	sl_delay(1);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7D, 0x06);//PWR_CTRL ENABLE ACC+GYR
	sl_delay(5);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x7D, 0x06);//PWR_CTRL ENABLE ACC+GYR
	sl_delay(200);
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x30, 0x00);//AIO1-disable
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x32, 0xff);//vth
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x33, 0xff);//tth

	if(odr_mode==25)
	{
		SL_Odr_Reg=0x06;
	}
	else if(odr_mode==50)
	{
		SL_Odr_Reg=0x07;
	}
	else if(odr_mode==100)
	{
		SL_Odr_Reg=0x08;
	}
	else if(odr_mode==200)
	{
		SL_Odr_Reg=0x09;
	}
	if(acc_hp_en==1)
		SL_acc_mode_Reg=0x80;

	SL_acc_mode_Reg=SL_acc_mode_Reg|SL_Odr_Reg;
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x40, SL_acc_mode_Reg);//ACC_CONF

	if(gyro_hp_en==1)
		SL_gyro_mode_Reg=0x40;
	else if(gyro_hp_en==2)
		SL_gyro_mode_Reg=0x80;
	else if(gyro_hp_en==3)
		SL_gyro_mode_Reg=0xC0;
	
	SL_gyro_mode_Reg=SL_gyro_mode_Reg|SL_Odr_Reg;
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x42, SL_gyro_mode_Reg);//GYR_CONF
	
	if(acc_range==2)
	{
		SL_acc_range_Reg=0x00;
	}
	else if(acc_range==4)
	{
		SL_acc_range_Reg=0x01;
	}
	else if(acc_range==8)
	{
		SL_acc_range_Reg=0x02;
	}		
	else if(acc_range==16)
	{
		SL_acc_range_Reg=0x03;
	}		
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x41, SL_acc_range_Reg);//ACC_RANGE
	
	if(gyro_range==2000)
	{
		SL_gyro_range_Reg=0x00;
	}
	else if(gyro_range==1000)
	{
		SL_gyro_range_Reg=0x01;
	}
	else if(gyro_range==500)
	{
		SL_gyro_range_Reg=0x02;
	}		
	else if(gyro_range==250)
	{
		SL_gyro_range_Reg=0x03;
	}
	else if(gyro_range==125)
	{
		SL_gyro_range_Reg=0x04;
	}
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x43, SL_gyro_range_Reg);//GYR_RANGE 2000dps
	SL_SC7U22_I2c_Spi_Write(SL_SPI_IIC_INTERFACE, 0x43, SL_gyro_range_Reg);//GYR_RANGE 2000dps
#if SL_Sensor_Algo_Release_Enable==0x00
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x40, 1, &SL_Read_Check);
//	USART_printf( USART1, "RawData:0x40=%x\r\n",SL_Read_Check);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x41, 1, &SL_Read_Check);
//	USART_printf( USART1, "RawData:0x41=%x\r\n",SL_Read_Check);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x42, 1, &SL_Read_Check);
//	USART_printf( USART1, "RawData:0x42=%x\r\n",SL_Read_Check);
//	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x43, 1, &SL_Read_Check);
//	USART_printf( USART1, "RawData:0x43=%x\r\n",SL_Read_Check);
#endif
	
