wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/docs/SL_SC7U22_AOI_Angle_Driver.c
	SL_SC7U22_I2c_Spi_Read(SL_SPI_IIC_INTERFACE, 0x43, 1,&SL_Read_Check);
	if(SL_Read_Check!=SL_gyro_range_Reg)
	{
#if SL_Sensor_Algo_Release_Enable==0x00	
		USART_printf( USART1, "SL_Read_Check=0x%x SL_gyro_range_Reg=0x%x\r\n",SL_Read_Check,SL_gyro_range_Reg);
#endif
		return 0;
	}
	return 1;
}


#if SL_SC7U22_FIFO_ENABLE ==0x00
//Kalman
//-------------------------------------------------------
float angle[3]={0,0,0}, angle_dot[3]={0,0,0}; 		//
float angle0[3]={0,0,0}, angle_dot0[3]={0,0,0}; 		//
//-------------------------------------------------------
//float Q_angle=0.0003, Q_gyro=0.001, R_angle=0.005, dt=0.005;//5ms ST
//float Q_angle=0.00001, Q_gyro=0.00001, R_angle=0.005, dt=0.0025;//5ms ST
float Q_angle=0.0003, Q_gyro=0.001, R_angle=0.005, dt=0.01;//10ms

float P[2][2]  = {{ 1, 0 },{ 0, 1 }};
float P0[2][2] = {{ 1, 0 },{ 0, 1 }};
float P1[2][2] = {{ 1, 0 },{ 0, 1 }};						
float P2[2][2] = {{ 1, 0 },{ 0, 1 }};				
float Pdot2[4] ={0,0,0,0};
float Pdot1[4] ={0,0,0,0};
float Pdot0[4] ={0,0,0,0};
const float C_0 = 1.0;
const float C_1 = 1.0;
const float C_2 = 1.0;
float q_bias[3]={0,0,0}, angle_err[3]={0,0,0}, PCt_0[3]={0,0,0}, PCt_1[3]={0,0,0},PCt_2[3]={0,0,0}, E[3]={0,0,0}, K_0[3]={0,0,0}, K_1[3]={0,0,0}, t_0[3]={0,0,0}, t_1[3]={0,0,0};
float q_bias0[3]={0,0,0}, angle_err0[3]={0,0,0}, PCt0_0[3]={0,0,0}, PCt0_1[3]={0,0,0}, E0[3]={0,0,0}, K0_0[3]={0,0,0}, K0_1[3]={0,0,0}, t0_0[3]={0,0,0}, t0_1[3]={0,0,0};
//-------------------------------------------------------

static signed short SL_GetAbsShort(signed short v_Val_s16r)
{
	if(v_Val_s16r==(-32768))
		return 32767;
	return (v_Val_s16r < 0) ? -v_Val_s16r : v_Val_s16r;
}

unsigned char SL_SC7U22_Error_Flag=0;
unsigned char SL_SC7U22_Error_cnt=0;
unsigned char SL_SC7U22_Error_cnt2=0;
signed short  Temp_Accgyro[6] ={0};
signed short  Error_Accgyro[6]={0};
signed int    Sum_Avg_Accgyro[6] ={0};
unsigned char  SL_SC7U22_Angle_Output(unsigned char calibration_en,signed short *acc_gyro_input,float *Angle_output, unsigned char yaw_rst)
{
	unsigned short acc_gyro_delta[2];
	unsigned char sl_i=0;
	float angle_acc[3]={0};
	float gyro_val[3]={0};
	
	if(calibration_en==0) 
	{
		SL_SC7U22_Error_Flag=1;
	}
	
	if(SL_SC7U22_Error_Flag==0)
	{
		acc_gyro_delta[0]=0;
		acc_gyro_delta[1]=0;
		for(sl_i=0;sl_i<3;sl_i++)
		{
			acc_gyro_delta[0]+=SL_GetAbsShort(acc_gyro_input[sl_i]-Temp_Accgyro[sl_i]);
			acc_gyro_delta[1]+=SL_GetAbsShort(acc_gyro_input[3+sl_i]-Temp_Accgyro[3+sl_i]);
		}
		for(sl_i=0;sl_i<6;sl_i++)
		{
			Temp_Accgyro[sl_i]=acc_gyro_input[sl_i];
		}
		
		if((acc_gyro_delta[0]/8<80)&&(acc_gyro_delta[1]<20)&&(SL_GetAbsShort(acc_gyro_input[0])<3000)&&(SL_GetAbsShort(acc_gyro_input[1])<3000)&&(SL_GetAbsShort(acc_gyro_input[2]-8192)<3000))//acc<80mg  gyro<20 lsb
		{
			if(SL_SC7U22_Error_cnt<200)
				SL_SC7U22_Error_cnt++;
		}
		else
		{
			SL_SC7U22_Error_cnt=0;
		}
	
		if(SL_SC7U22_Error_cnt>190)
		{
			for(sl_i=0;sl_i<6;sl_i++)
			{
				Sum_Avg_Accgyro[sl_i]+=acc_gyro_input[sl_i];
			}
			SL_SC7U22_Error_cnt2++;
			if(SL_SC7U22_Error_cnt2>49)
			{
				SL_SC7U22_Error_Flag=1;
				SL_SC7U22_Error_cnt2=0;
				SL_SC7U22_Error_cnt=0;
				for(sl_i=0;sl_i<6;sl_i++)
				{
					Sum_Avg_Accgyro[sl_i]=Sum_Avg_Accgyro[sl_i]/50;
				}
				
				Error_Accgyro[0]=0-Sum_Avg_Accgyro[0];
				Error_Accgyro[1]=0-Sum_Avg_Accgyro[1];
				Error_Accgyro[2]=8192-Sum_Avg_Accgyro[2];
				Error_Accgyro[3]=0-Sum_Avg_Accgyro[3];
				Error_Accgyro[4]=0-Sum_Avg_Accgyro[4];
				Error_Accgyro[5]=0-Sum_Avg_Accgyro[5];
#if SL_Sensor_Algo_Release_Enable==0x00
				USART_printf(USART1,"AVG_Recode AX:%d,AY:%d,AZ:%d,GX:%d,GY:%d,GZ:%d\r\n",Sum_Avg_Accgyro[0],Sum_Avg_Accgyro[1],Sum_Avg_Accgyro[2],Sum_Avg_Accgyro[3],Sum_Avg_Accgyro[4],Sum_Avg_Accgyro[5]);
				USART_printf(USART1,"Error_Recode AX:%d,AY:%d,AZ:%d,GX:%d,GY:%d,GZ:%d\r\n",Error_Accgyro[0],Error_Accgyro[1],Error_Accgyro[2],Error_Accgyro[3],Error_Accgyro[4],Error_Accgyro[5]);		
#endif
			}
		}
		else
		{
			SL_SC7U22_Error_cnt2=0;
			for(sl_i=0;sl_i<6;sl_i++)
			{
				Sum_Avg_Accgyro[sl_i]=0;
			}
		}
		
		return 0;
	}
	
	
	if(SL_SC7U22_Error_Flag==1)
	{
		for(sl_i=0;sl_i<6;sl_i++)
		{
			Temp_Accgyro[sl_i]=acc_gyro_input[sl_i]+Error_Accgyro[sl_i];
		}//-error
		
#if 1   //output calibration data
		for(sl_i=0;sl_i<6;sl_i++)
		{
			acc_gyro_input[sl_i]=Temp_Accgyro[sl_i];
		}
#endif		
		angle_acc[0]=(float)Temp_Accgyro[0]/8192;//ax
		angle_acc[1]=(float)Temp_Accgyro[1]/8192;//ay       
		angle_acc[2]=(float)Temp_Accgyro[2]/8192;//az

		if(angle_acc[0]>1.0)    angle_acc[0]= 1.0;
		if(angle_acc[0]<-1.0)   angle_acc[0]=-1.0;
		if(angle_acc[1]>1.0)    angle_acc[1]= 1.0;
		if(angle_acc[1]<-1.0)   angle_acc[1]=-1.0;
		if(angle_acc[2]>1.0)    angle_acc[2]= 1.0;
		if(angle_acc[2]<-1.0)   angle_acc[2]=-1.0;

		angle_acc[0] = asinf(angle_acc[0])*57.32484;//Pitch:-90~+90
		if((angle_acc[2]<0.001)&&(angle_acc[2]>-0.001))
		{
			if(angle_acc[2]>0) 
				angle_acc[2]=0.001;
			else
				angle_acc[2]=-0.001;
		}	
		angle_acc[1] =-atanf(angle_acc[1]/angle_acc[2])*57.32484;//Roll: -180~+180
		
		if(angle_acc[2]>=0)
		{
			angle_acc[1]=angle_acc[1];
		}
		else
		{
			if(angle_acc[1]>=0)
				angle_acc[1]=-180+angle_acc[1];
			else
				angle_acc[1]=180+angle_acc[1];
		}
	
		gyro_val[0]=Temp_Accgyro[4]*0.061;//lsb-->dps
		gyro_val[1]=Temp_Accgyro[3]*0.061;//lsb-->dps
		gyro_val[2]=Temp_Accgyro[5]*0.061;//lsb-->dps
		
		/**************Pitch**************/
		angle0[0] += (gyro_val[0]-q_bias0[0]) * dt;
		Pdot0[0] = Q_angle - P0[0][1] - P0[1][0]+P[1][1]*dt;
		Pdot0[1] = - P0[1][1];
		Pdot0[2] = - P0[1][1];
		Pdot0[3] = Q_gyro;
		
		P0[0][0] += Pdot0[0] * dt;
		P0[0][1] += Pdot0[1] * dt;
		P0[1][0] += Pdot0[2] * dt;
		P0[1][1] += Pdot0[3] * dt;	
		//P(K|K-1) 
		
		PCt0_0[0] = C_0 * P0[0][0];
		PCt0_1[0] = C_0 * P0[1][0];
		
		E0[0] = R_angle + C_0 * PCt0_0[0];
		if(E0[0]==0)
		{
			E0[0]=0.0001;
		}

		K0_0[0] = PCt0_0[0] / E0[0];
		K0_1[0] = PCt0_1[0] / E0[0];
		
		angle_err0[0] = angle_acc[0] - angle0[0];
		angle0[0]	+= K0_0[0] * angle_err0[0];
		q_bias0[0] += K0_1[0] * angle_err0[0];
		angle_dot0[0] = gyro_val[0]-q_bias0[0];

		t0_0[0] = PCt0_0[0];
		t0_1[0] = C_0 * P0[0][1];

		P0[0][0] -= K0_0[0] * t0_0[0];
		P0[0][1] -= K0_0[0] * t0_1[0];
		P0[1][0] -= K0_1[0] * t0_0[0];
		P0[1][1] -= K0_1[0] * t0_1[0];
		Angle_output[0]=angle0[0];
		
		/**************Roll**************/
		angle0[1] += (gyro_val[1]-q_bias0[1]) * dt;
		Pdot1[0]=Q_angle - P1[0][1] - P1[1][0]+P[1][1]*dt;
		Pdot1[1] = - P1[1][1];
		Pdot1[2] = - P1[1][1];
		Pdot1[3]=Q_gyro;
		
		P1[0][0] += Pdot1[0] * dt;
		P1[0][1] += Pdot1[1] * dt;
		P1[1][0] += Pdot1[2] * dt;
		P1[1][1] += Pdot1[3] * dt;
		
		PCt0_0[1] = C_1 * P1[0][0];
		PCt0_1[1] = C_1 * P1[1][0];
		
		E0[1] = R_angle + C_1 * PCt0_0[1];
		if(E0[1]==0)
		{
			E0[1]=0.0001;
		}
		
		K0_0[1] = PCt0_0[1] / E0[1];
		K0_1[1] = PCt0_1[1] / E0[1];
		
		angle_err0[1] = angle_acc[1] - angle0[1];
		angle0[1]	+= K0_0[1] * angle_err0[1];
		q_bias0[1] += K0_1[1] * angle_err0[1];
		angle_dot0[1] = gyro_val[1]-q_bias0[1];

		t0_0[1] = PCt0_0[1];
		t0_1[1] = C_1 * P1[0][1];

		P1[0][0] -= K0_0[1] * t0_0[1];
		P1[0][1] -= K0_0[1] * t0_1[1];
		P1[1][0] -= K0_1[1] * t0_0[1];
		P1[1][1] -= K0_1[1] * t0_1[1];
		Angle_output[1]=angle0[1];
		
		if(yaw_rst==1)
			Angle_output[2]=0;
			
		if(SL_GetAbsShort(Temp_Accgyro[5])>8)
			Angle_output[2]+=gyro_val[2]*dt;
		
		return 1;
	}
	
	return 2;//error status
}



#endif

